In [3]:
import pandas as pd

In [4]:
purchase_data_df = pd.read_csv("Resources/purchase_data.csv")

In [5]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

In [6]:
Num_players = purchase_data_df["SN"].nunique()
Num_players

576

In [7]:
pd.DataFrame(data=[Num_players], columns=["Total Players"])

   Total Players
0            576

## Purchasing Analysis (Total)
### number of unique items

In [8]:
unique_items = purchase_data_df["Item Name"].nunique()
unique_items

179

### average price

In [9]:
Average = (purchase_data_df["Price"]).mean()
Average

3.050987179487176

### number of purchases

In [10]:
Num_purchase = purchase_data_df["Purchase ID"].value_counts()
Num_purchase

779    1
243    1
265    1
264    1
263    1
      ..
517    1
516    1
515    1
514    1
0      1
Name: Purchase ID, Length: 780, dtype: int64

In [11]:
Total_num = Num_purchase.sum()
Total_num

780

### Total revenue

In [12]:
Total_revenue = purchase_data_df["Price"].sum()
Total_revenue

2379.77

In [13]:
pd.DataFrame(data=[[unique_items, Average, Total_num, Total_revenue]], columns=["Number of Unique Items", "Average Price", "Number of Purchases", "Total Revenue"])

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

## Gender Demographics
### Percentage and Count of Male Players

In [14]:
gender_count = purchase_data_df.groupby("Gender")[["SN"]].nunique()
gender_count

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [15]:
gender_count["SN"]/Num_players

Gender
Female                   0.140625
Male                     0.840278
Other / Non-Disclosed    0.019097
Name: SN, dtype: float64

In [16]:
gender_count["Percentage of Players"] = gender_count["SN"]/Num_players

In [17]:
gender_count

                        SN  Percentage of Players
Gender
Female                  81               0.140625
Male                   484               0.840278
Other / Non-Disclosed   11               0.019097

In [18]:
##gender_count.reset_index(inplace = True)

In [19]:
gender_count

                        SN  Percentage of Players
Gender
Female                  81               0.140625
Male                   484               0.840278
Other / Non-Disclosed   11               0.019097

In [20]:
gender_count.rename(columns={'SN':"Total Count"}, inplace=True)

In [21]:
gender_count

                       Total Count  Percentage of Players
Gender
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

In [22]:
gender_count.index.name = None

In [23]:
gender_count

                       Total Count  Percentage of Players
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

## Purchasing Analysis (Gender)

In [24]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [25]:
purchase_count = purchase_data_df.groupby("Gender")[["Purchase ID"]].nunique()
purchase_count

                       Purchase ID
Gender
Female                         113
Male                           652
Other / Non-Disclosed           15

In [26]:
purchase_count.rename(columns= {'Purchase ID': "Purchase Count"}, inplace=True)

In [27]:
purchase_count

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

### Average Purchase Price

In [28]:
Average_purchase_price = purchase_data_df.groupby("Gender")[["Price"]].mean()
Average_purchase_price

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [252]:
Average_purchase_price.rename(columns= {'Price': "Average Purchase Price"}, inplace=True)

In [29]:
Average_purchase_price

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

### Total Purchase Value

In [30]:
Total_purchase_value = purchase_data_df.groupby("Gender")[["Price"]].sum()
Total_purchase_value

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [31]:
Total_purchase_value.rename(columns= {'Price': "Total Purchase Value"}, inplace=True)

In [32]:
Total_purchase_value

                       Total Purchase Value
Gender
Female                               361.94
Male                                1967.64
Other / Non-Disclosed                 50.19

### Avg Total Purchase per Person

In [33]:
Avg_Total = Total_purchase_value["Total Purchase Value"]/gender_count["Total Count"]
Avg_Total

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [34]:
Avg_Total = Avg_Total.to_frame()

In [35]:
Avg_Total

                              0
Gender
Female                 4.468395
Male                   4.065372
Other / Non-Disclosed  4.562727

In [36]:
Avg_Total.rename(columns= {0: "Avg Total Purchase per Person"}, inplace=True)

In [37]:
Avg_Total

                       Avg Total Purchase per Person
Gender
Female                                      4.468395
Male                                        4.065372
Other / Non-Disclosed                       4.562727

In [38]:
pd.concat([purchase_count, Average_purchase_price, Total_purchase_value, Avg_Total], axis=1)

,Purchase Count,Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

In [40]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [67]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 75]

group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [68]:
purchase_data_df["Age Ranges"] = pd.cut(purchase_data_df["Age"], bins, labels=group_names, include_lowest=True)

In [69]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [73]:
Purchase_Count = purchase_data_df.groupby("Age Ranges")[["Purchase ID"]].count()

In [74]:
Purchase_Count

            Purchase ID
Age Ranges
<10                  23
10-14                28
15-19               136
20-24               365
25-29               101
30-34                73
35-39                41
40+                  13

In [76]:
Purchase_Count.rename(columns= {"Purchase ID": "Purchase Count"}, inplace=True)

In [77]:
Purchase_Count

            Purchase Count
Age Ranges
<10                     23
10-14                   28
15-19                  136
20-24                  365
25-29                  101
30-34                   73
35-39                   41
40+                     13

In [80]:
Purchase_Count.sort_values('Purchase Count', ascending=False)

            Purchase Count
Age Ranges
20-24                  365
15-19                  136
25-29                  101
30-34                   73
35-39                   41
10-14                   28
<10                     23
40+                     13

In [91]:
Average_Purchase_Price = purchase_data_df.groupby("Age Ranges")[["Price"]].mean()
Average_Purchase_Price

               Price
Age Ranges
<10         3.353478
10-14       2.956429
15-19       3.035956
20-24       3.052219
25-29       2.900990
30-34       2.931507
35-39       3.601707
40+         2.941538

In [101]:
Average_Purchase_Price.rename(columns= {'Price': "Average Purchase Price"}, inplace=True)

In [102]:
Average_Purchase_Price

            Average Purchase Price
Age Ranges
<10                       3.353478
10-14                     2.956429
15-19                     3.035956
20-24                     3.052219
25-29                     2.900990
30-34                     2.931507
35-39                     3.601707
40+                       2.941538

In [106]:
Total_Purchase_Value = purchase_data_df.groupby("Age Ranges")[["Price"]].sum()
Total_Purchase_Value

              Price
Age Ranges
<10           77.13
10-14         82.78
15-19        412.89
20-24       1114.06
25-29        293.00
30-34        214.00
35-39        147.67
40+           38.24

In [108]:
Total_Purchase_Value.rename(columns= {'Price': "Total Purchase Value"}, inplace=True)

In [109]:
Total_Purchase_Value

            Total Purchase Value
Age Ranges
<10                        77.13
10-14                      82.78
15-19                     412.89
20-24                    1114.06
25-29                     293.00
30-34                     214.00
35-39                     147.67
40+                        38.24

In [111]:
Total_price = purchase_data_df.groupby("Age")[["Price"]].sum()
Total_price

      Price
Age
7     32.89
8     25.97
9     18.27
10    31.83
11    18.79
12    15.80
13     9.45
14     6.91
15   105.65
16    90.56
17    64.48
18    82.22
19    69.98
20   314.32
21   180.74
22   206.85
23   201.93
24   210.22
25   181.90
26    40.19
27    27.23
28     8.45
29    35.23
30   110.32
31    24.05
32    22.69
33    34.81
34    22.13
35    52.03
36    12.66
37    25.51
38    34.15
39    23.32
40    16.71
41     6.54
42     3.93
43     4.00
44     5.36
45     1.70

## Top Spenders

In [116]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [117]:
purchase_data_df.groupby("SN")[["Purchase ID"]].count()

               Purchase ID
SN
Adairialis76             1
Adastirin33              1
Aeda94                   1
Aela59                   1
Aelaria33                1
...                    ...
Yathecal82               3
Yathedeu43               2
Yoishirrala98            1
Zhisrisu83               2
Zontibe81                3

[576 rows x 1 columns]